<template>
  <Main />
</template>
<script>
import Main from '@/components/Main.vue';
import { provide } from 'vue';

export default {
  setup() {
    const content = {
      ufa: {
        home: 'https://ufa.planeta-mall.ru/',
        terms: [
          'Совершайте покупку с 10:00 <span>5 декабря</span> по 22:00 <span>25 декабря 2022 г.</span> на&nbsp;сумму от 5 000 рублей в одном чеке в ТРЦ «Планета»¹ или приобретайте подарочную карту ТРЦ «Планета» на сумму от 5 000 рублей на стойке информации или на сайте <a class="link-thin" href="https://ufa.planeta-mall.ru/gift-card" target="_blank">ufa.planeta-mall.ru/gift-card²</a>;',
          'Регистрируйте чек³ в Личном кабинете <a href="https://id.mall.tech" target="_blank">id.mall.tech</a> и гарантированно получайте 500 рублей кэшбэк⁴;',
          'Приз можно получить на стойке информации в период <span>с 5 по 30 декабря</span> в часы работы ТРЦ. Для получения приза требуется иметь при себе номер телефона, с которого производилась регистрация в акции.'
        ],
        footer: [
          `<p>За исключением гипермаркета «О’КЕЙ» и арендаторов на его  , кинотеатра «Киномакс», парка развлечений «Мегалэнд», предприятий общественного питания (рестораны, кафе, киоски, и пр. предприятия общественного питания или оказания услуг), в том числе в зоне фудкорта ТРЦ «Планета», арендаторов Дома быта, салона красоты  «Чио-чио», Q-store, Churchill, Corsar, детских развлекательных аттракционов, а также, туристических агентств и магазинов островной торговли ТРЦ (Coffee Like, NicePriceCoffee, NiceCream, Праздничная лавка, BRONOSKINS, O:space, Yota, FOR SMOKE, JoyeShop, Город тачек).</p>`,
          `<p>В Акции не принимают участие корпоративные подарочные карты ТРЦ «Планета», приобретенные по безналичному расчету. Чеки из одной или нескольких торговых точек между собой не суммируются. Чеки от приобретения подарочных сертификатов в любой торговой точке ТРЦ «Планета» не дают право участвовать в Акции (кроме чеков от приобретения подарочных карт ТРЦ «Планета»).</p>`,
          `
            <p>Участник Акции может зарегистрировать не более 1 чека за весь период акции. Чек считается зарегистрированным в акции после прохождения проверки организатором акции. Организатор Акции оставляет за собой право отклонить регистрацию чека в случае обнаружения нарушения правил Акции.</p>
            <p>Внешний вид призов, комплектация, цветовое изображение могут отличаться от указанного в настоящем рекламном макете и интернете. Количество призов ограничено. Возможно досрочное прекращение акции при выдаче всех акционных товаров.Подробная информация об организаторе Акции, о правилах и порядке ее проведения, количестве призов, сроках, месте и порядке их получения на сайте <a href="https://ufa.planeta-mall.ru" target="_blank">ufa.planeta-mall.ru</a></p>
          `,
        ],
        social: {
          vk: 'https://vk.com/trc_planeta_ufa',
          tg: 'https://t.me/trc_planeta_ufa',
          rutube: 'https://rutube.ru/channel/24694861',
          youtube: 'https://www.youtube.com/channel/UCwQ9kwTOFChkJKrMOMqJ-pg',
          ok: 'https://ok.ru/group/57048741838907',
        },
        address: 'ТРЦ «Планета», <br> Уфа, Энтузиастов, 20'
      },
      krs: {
        home: 'https://krs.planeta-mall.ru/',
        terms: [
          'Совершайте покупку с 10:00 <span>5 декабря</span> по 22:00 <span>25 декабря 2022 г.</span> на&nbsp;сумму от 5 000 рублей в одном чеке в ТРЦ «Планета»¹ или приобретайте подарочную карту ТРЦ «Планета» на сумму от 5 000 рублей на стойке информации или на сайте <a class="link-thin" href="https://krs.planeta-mall.ru/gift-card" traget="_blank">krs.planeta-mall.ru/gift-card²;',
          'Регистрируйте чек³ в Личном кабинете <a href="https://id.mall.tech" target="_blank">id.mall.tech</a> и гарантированно получайте 500 рублей кэшбэк⁴;',
          'Приз можно получить на стойке информации в период <span>с 5 по 26 декабря</span> в часы работы ТРЦ. Для получения приза требуется иметь при себе номер телефона, с которого производилась регистрация в акции.'
        ],
        footer: [
          `<p>За исключением гипермаркета «О’КЕЙ» и арендаторов на его территории, кинотеатра «Киномакс», предприятий общественного питания (ресторанов, кафе, киосков и прочих предприятий общественного питания или оказания услуг), в том числе в зоне фудкорта ТРЦ «Планета», в гипермаркете «Леруа Мерлен» и зоне его фуд-корта, химчистки «Мистер чисто», «Ателье», мастерской «ExpresS Мастерская», детских развлекательных аттракционов, магазинов островной торговли, оказывающих услуги, в том числе услуги общественного питания, а также развлекательного центра «Vanana park» и зоны его фудкорта, тренажерного зала «Колизей», а также покупок подарочных карт/сертификатов торговых точек и переводов денежных средств при оплате услуг сотовой связи и Интернет в любых торговых точках ТРЦ «Планета» и стойки Planetacard Халва.</p>`,
          `<p>В Акции не принимают участие корпоративные подарочные карты ТРЦ «Планета», приобретенные по безналичному расчету. Чеки из одной или нескольких торговых точек между собой не суммируются. Чеки от приобретения подарочных сертификатов в любой торговой точке ТРЦ «Планета» не дают право участвовать в Акции (кроме чеков от приобретения подарочных карт ТРЦ «Планета»).</p>`,
          `
            <p>Участник Акции может зарегистрировать не более 1 чека за весь период акции. Чек считается зарегистрированным в акции после прохождения проверки организатором акции. Организатор Акции оставляет за собой право отклонить регистрацию чека в случае обнаружения нарушения правил Акции.</p>
            <p>Внешний вид призов, комплектация, цветовое изображение могут отличаться от указанного в настоящем рекламном макете и интернете. Количество призов ограничено. Возможно досрочное прекращение акции при выдаче всех акционных товаров.Подробная информация об организаторе Акции, о правилах и порядке ее проведения, количестве призов, сроках, месте и порядке их получения на сайте <a href="https://krs.planeta-mall.ru" target="_blank">krs.planeta-mall.ru</a></p>
          `
        ],
        social: {
          vk: 'https://vk.com/public50952130',
          tg: 'https://t.me/tc_planeta',
          rutube: 'https://rutube.ru/channel/24664992',
          youtube: 'https://www.youtube.com/channel/UCCcsNs80DRLL-lF6JzV1_eg/videos',
          ok: 'https://ok.ru/planetakras',
        },
        address: 'ТРЦ «Планета», <br> Красноярск, ул. 9 Мая, 77'
      }
    };

    provide('content', content['krs']);
  },
  components: {
    Main
  }
}
</script>
